{
  "Listener": {
    "Name": "AWS::ElasticLoadBalancingV2::Listener",
    "Description": "The SSL server certificate for the listener. With a certificate, you can encrypt traffic between the load balancer and the clients that initiate HTTPS sessions, and traffic between the load balancer and your targets.The default actions that the listener takes when handling incoming requests.The Amazon Resource Name (ARN) of the load balancer to associate with the listener.The port on which the listener listens for requests.For valid values, see the Port parameter for the CreateListener action in the Elastic Load Balancing API Reference version 2015-12-01.The protocol that clients must use to send requests to the listener.For valid values, see the Protocol parameter for the CreateListener action in the Elastic Load Balancing API Reference version 2015-12-01.The security policy that defines the ciphers and protocols that the load balancer supports.",
    "Array": true,
    "Type": "String",
    "Required": "No",
    "UpdateRequires": "No interruption"
  },
  "ListenerRule": {
    "Name": "AWS::ElasticLoadBalancingV2::ListenerRule",
    "Description": "The action that the listener takes when a request meets the specified condition.The conditions under which a rule takes effect.The Amazon Resource Name (ARN) of the listener that the rule applies to.The priority for the rule. Elastic Load Balancing evaluates rules in priority order, from the lowest value to the highest value. If a request satisfies a rule, Elastic Load Balancing ignores all subsequent rules.NoteA target group can have only one rule with a given priority.For valid values, see the Priority parameter for the CreateRule action in the Elastic Load Balancing API Reference version 2015-12-01.",
    "Array": true,
    "Type": "Integer",
    "Required": "Yes",
    "UpdateRequires": "No interruption"
  },
  "LoadBalancer": {
    "Name": "AWS::ElasticLoadBalancingV2::LoadBalancer",
    "Description": "Specifies the load balancer configuration.Specifies a name for the load balancer. This name must be unique within your AWS\n            account and can have a maximum of 32 alphanumeric characters and hyphens. A name can't\n            begin or end with a hyphen.Specifies whether the load balancer is internal or Internet-facing. An internal load\n            balancer routes requests to targets using private IP addresses. An Internet-facing load\n            balancer routes requests from clients over the Internet to targets in your public\n            subnets. For valid and default values, see the Scheme parameter for the\n                CreateLoadBalancer action in the\n              Elastic Load Balancing API Reference version 2015-12-01.Specifies a list of the IDs of the security groups to assign to the load\n            balancer.Specifies a list of at least two IDs of the subnets to associate with the load\n            balancer. The subnets must be in different Availability Zones.Specifies an arbitrary set of tags (key–value pairs) to associate with this\n            load balancer. Use tags to manage your resources.The DNS name for the Application load balancer, for example\n                my-load-balancer-424835706.us-west-2.elb.amazonaws.com.The ID of the Amazon Route 53 hosted zone associated with the load balancer, for example\n                Z2P70J7EXAMPLE.The full name of the Application load balancer, for example\n                app/my-load-balancer/50dc6c495c0c9188.The name of the Application load balancer, for example my-load-balancer.The IDs of the security groups for the Application load balancer, for example\n              sg-123456a.",
    "Array": true,
    "Type": "AWSCloudFormationResourceTags",
    "Required": "No",
    "UpdateRequires": "No interruption"
  },
  "TargetGroup": {
    "Name": "AWS::ElasticLoadBalancingV2::TargetGroup",
    "Description": "The approximate number of seconds between health checks for an individual target.The ping path destination where Elastic Load Balancing sends health check requests.The port that the load balancer uses when performing health checks on the targets.For valid and default values, see the HealthCheckPort parameter for the CreateTargetGroup action in the Elastic Load Balancing API Reference version 2015-12-01.The protocol that the load balancer uses when performing health checks on the targets, such as HTTP or HTTPS.For valid and default values, see the HealthCheckProtocol parameter for the CreateTargetGroup action in the Elastic Load Balancing API Reference version 2015-12-01.The number of seconds to wait for a response before considering that a health check has failed.The number of consecutive successful health checks that are required before an unhealthy target is considered healthy.The HTTP codes that a healthy target uses when responding to a health check.A name for the target group.ImportantThe target group name should be shorter than 22 characters because AWS CloudFormation uses the target group name to create the name of the load balancer.The port on which the targets receive traffic.The protocol to use for routing traffic to the targets.An arbitrary set of tags (key–value pairs) for the target group. Use tags to help manage resources.Target group configurations.The full name of the target group.The targets to add to this target group.The number of consecutive failed health checks that are required before a target is considered unhealthy.The ID of the VPC in which your targets are located.A list of  Amazon Resource Names (ARNs) of the load balancers that route traffic\n              to this target group, such as [\n                \"arn:aws:elasticloadbalancing:us-west-2:123456789012:loadbalancer/app/my-load-balancer/50dc6c495c0c9188\"\n                ].",
    "Array": true,
    "Type": "String",
    "Required": "Yes",
    "UpdateRequires": "Replacement"
  }
}
